CALL_SCHEDULE = """
🔸 1 пара
🕑 8:00-9:20

🔸 2 пара
🕑 9.40-11:00

🔸 3 пара
🕑 11:20-12:40

🔸 4 пара
🕑 13:00-14:20

🔸 5 пара
🕑 14:40-16:00

🔸 6 пара
🕑 16:20-17:40

🔸 7 пара
🕑 18:00-19:20

🔸 8 пара
🕑 19:40-21:00
"""

DEPARTMENTS_LIST = """
Список доступных факультетов:
    АКФ
    ФАБД
    ФАЕТ
    ФЕБIТ
    ФЕБА
    ФККПI
    ФЛСК 
    ФМВ
    ФТМЛ
    ЦМО
    ЮФ

"""

PAIR_TIME = {
    1: '8:00-9:20',
    2: '9.40-11:00',
    3: '11:20-12:40',
    4: '13:00-14:20',
    5: '14:40-16:00',
    6: '16:20-17:40',
    7: '18:00-19:20',
    8: '19:40-21:00',
}

ADMIN_ITEMS = [
    'Изменить текущую неделю',
    'Включить рассылку',
    'Выключить рассылку',
    'Назад'
]

DASHBOARD_ITEMS = [
    'Расписание',
    'Расписание звонков',
    'На сегодня',
    'На завтра',
    'Крутить барабан',
    'Текущая неделя',
    'Жаловаться сюда',
    'Настройки'
]

SETTING_ITEMS = [
    'Изменить факультет, группу и подгруппу',
    'Рассылка',
    'Назад'
]

SCHEDULE_DAYS = [
    '1.Пнд',
    '1.Втр',
    '1.Срд',
    '1.Чтв',
    '1.Птн',
    '2.Пнд',
    '2.Втр',
    '2.Срд',
    '2.Чтв',
    '2.Птн',
]

DAY_NUMS = {
    1: 'Пнд',
    2: 'Втр',
    3: 'Срд',
    4: 'Чтв',
    5: 'Птн',

}


def pair_template(pair):
    return f"""
➡️ {pair['num']} пара
🕑 ({pair['time']})
📘 {pair['discipline']}
👨 {pair['teacher']}
🚪 {pair['classroom']}
"""
